---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexPosition
source: html/407506ae-d5b7-f799-13a8-7395b8f448fa.htm
---
# VertexPosition Members

Constructs the vertex from a point.